app/Controllers/Amos.php

    public function index()
    {
        $amo = new Amo();
        $datos['amos'] = $amo->orderBy('a_id', 'ASC')->findAll();
---
SELECT *
FROM `amo`
ORDER BY `a_id` ASC

    public function guardar()
    {
        $amo = new Amo();

        // Obtener los datos del formulario con los NOMBRES correctos
        $datos = [
            'a_nombre'   => $this->request->getPost('a_nombre'),
            'a_apellido' => $this->request->getPost('a_apellido'),
            'a_dir'      => $this->request->getPost('a_dir'),
            'a_tel'      => $this->request->getPost('a_tel'),
        ];

        // Subida de imagen (opcional)
        if ($imagen = $this->request->getFile('imagen')) {
            if ($imagen->isValid() && !$imagen->hasMoved()) {
                $nuevoNombre = $imagen->getRandomName();
                $imagen->move('../public/imagenes/', $nuevoNombre);
                $datos['imagen'] = $nuevoNombre;
            }
        }

        $amo->insert($datos);
---
INSERT INTO `amo` (`a_nombre`, `a_apellido`, `a_dir`, `a_tel`) VALUES ('Gabriel', 'Villalobo', 'San Martin 111', '2665434343')

    public function borrar($id=null){

        $amo=new Amo();
        $datosAmo=$amo->where('a_id',$id)->first();

        $amo->where('a_id',$id)->delete($id);
---
SELECT *
FROM `amo`
WHERE `a_id` = '9'
 LIMIT 1
DELETE FROM `amo`
WHERE `a_id` = '9'
AND `a_id` IN ('9')

    public function editar($id=null){


        $amo=new Amo();

        $datos['amo']=$amo->where('a_id',$id)->first();
---
SELECT *
FROM `amo`
WHERE `a_id` = '1'
 LIMIT 1